---
type: PolymeshTopology
namespace: Autodesk.Revit.DB
version: 2024
members: 15
tags: [revit-api, class]
---

# PolymeshTopology

`Autodesk.Revit.DB.PolymeshTopology` · Revit 2024 · 15 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetFacet | 2014 | `public PolymeshFacet GetFacet ( int idx )` |
| Method | GetFacets | 2014 | `public IList < PolymeshFacet > GetFacets ()` |
| Method | GetNormal | 2014 | `public XYZ GetNormal ( int idx )` |
| Method | GetNormals | 2014 | `public IList < XYZ > GetNormals ()` |
| Method | GetPoint | 2014 | `public XYZ GetPoint ( int idx )` |
| Method | GetPoints | 2014 | `public IList < XYZ > GetPoints ()` |
| Method | GetUV | 2014 | `public UV GetUV ( int idx )` |
| Method | GetUVs | 2014 | `public IList < UV > GetUVs ()` |
| Property | DistributionOfNormals | 2014 | `public DistributionOfNormals DistributionOfNormals { get ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | NumberOfFacets | 2014 | `public int NumberOfFacets { get ; }` |
| Property | NumberOfNormals | 2014 | `public int NumberOfNormals { get ; }` |
| Property | NumberOfPoints | 2014 | `public int NumberOfPoints { get ; }` |
| Property | NumberOfUVs | 2014 | `public int NumberOfUVs { get ; }` |